cases/cfd/fluids/channel_retau395_repair_closure/environment/case/0/omega
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions [0 0 -1 0 0 0 0];

// Specific dissipation rate. omega ~ sqrt(k) / (Cmu^0.25 * l) with mixing
// length l ~ 0.1 * delta gives omega ~ sqrt(1) / (0.548 * 0.1) ~ 18.
internalField uniform 10;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    // omegaWallFunction is valid for both low-Re and wall-function meshes.
    bottomWall
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
    topWall
    {
        type            omegaWallFunction;
        value           uniform 10;
    }
    frontAndBack
    {
        type            empty;
    }
}
