cases/cfd/fluids/channel_retau395_repair_closure/environment/case/system/bulkU
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object bulkU;
}
type volFieldValue;
libs (fieldFunctionObjects);
writeFields false;
log true;
regionType all;
operation volAverage;
fields (U);
