cases/cfd/fluids/channel_retau395_repair_closure/environment/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         5000;

deltaT          1;

writeControl    timeStep;
writeInterval   1000;

purgeWrite      2;

writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    // Wall shear stress on both walls -> u_tau = sqrt(|tau_w|) (kinematic, rho=1).
    wallShearStress1
    {
        type            wallShearStress;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     true;
        patches         (bottomWall topWall);
    }

    // Volume-averaged streamwise velocity over the whole channel -> bulk velocity Ub.
    bulkU
    {
        type            volFieldValue;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        writeFields     false;
        log             true;
        regionType      all;
        operation       volAverage;
        fields          (U);
    }
}
